In [59]:
import pandas as pd
import re

df = pd.read_csv('query2.csv',',')
df.head()

           Team_to     Season country_name      fees
0          Arsenal  2000-2001      England  42600000
1        Liverpool  2000-2001      England   9000000
2          Chelsea  2000-2001      England   9400000
3       Sunderland  2000-2001      England   4700000
4  Manchester City  2000-2001      England   4500000

In [57]:

df = df[['Team_to','Season','country_name','fees']]
df
print(df.shape)
table =pd.pivot_table(df, values='fees', 
                index=['Team_to','country_name'], 
                    columns='Season')
table.to_csv('transf.csv', encoding='utf-8',)

#df = pd.DataFrame(data) 
  
#df = pd.DataFrame(df_grouped) 
  
# pivoting the dataframe 
#df =df_grouped.pivot(index ='Season', columns ='name') 
  
#df

(1148, 4)

In [61]:
df = pd.read_csv('transf.csv',',')
df.head()

,Team_to,country_name,2000-2001,2001-2002,2002-2003,2003-2004,2004-2005,2005-2006,2006-2007,2007-2008,...,2010-2011,2011-2012,2012-2013,2013-2014,2014-2015,2015-2016,2016-2017,2017-2018,2018-2019,Total
0,1. FC Köln,Germany,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,24000000.0,NaN,34000000
1,1. FSV Mainz 05,Germany,NaN,NaN,NaN,NaN,NaN,NaN,2800000.0,NaN,...,NaN,NaN,NaN,5000000.0,NaN,NaN,6500000.0,NaN,14000000.0,28300000
2,AC Milan,Italy,19000000.0,122500000.0,64000000.0,10250000.0,NaN,33500000.0,38050000.0,29000000.0,...,30850000.0,47000000.0,48000000.0,31500000.0,11250000.0,83000000.0,16500000.0,158000000.0,25500000.0,842150000
3,AFC Ajax,Netherlands,5300000.0,15500000.0,NaN,9500000.0,4900000.0,14300000.0,NaN,7500000.0,...,5000000.0,4000000.0,4000000.0,NaN,7000000.0,6000000.0,23000000.0,7500000.0,41650000.0,194400000
4,AJ Auxerre,France,NaN,NaN,1000000.0,4000000.0,NaN,5000000.0,12300000.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,22300000